In [12]:
%load_ext sql
%sql postgresql://db:db@postgres/db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [39]:
%%sql
DROP TABLE IF EXISTS customer CASCADE;
DROP TABLE IF EXISTS orders CASCADE;
DROP TABLE IF EXISTS pay CASCADE;
DROP TABLE IF EXISTS employee CASCADE;
DROP TABLE IF EXISTS process CASCADE;
DROP TABLE IF EXISTS department CASCADE;
DROP TABLE IF EXISTS workplace CASCADE;
DROP TABLE IF EXISTS works CASCADE;
DROP TABLE IF EXISTS office CASCADE;
DROP TABLE IF EXISTS warehouse CASCADE;
DROP TABLE IF EXISTS product CASCADE;
DROP TABLE IF EXISTS contains CASCADE;
DROP TABLE IF EXISTS supplier CASCADE;
DROP TABLE IF EXISTS delivery CASCADE;
CREATE TABLE customer(
cust_no INTEGER PRIMARY KEY,
name VARCHAR(80) NOT NULL,
email VARCHAR(254) UNIQUE NOT NULL,
phone VARCHAR(15),
address VARCHAR(255) /*CHECK (address ~ '^[0-9]+\s*[a-zA-ZÀ-ú]+,\s*[0-9]{4}-[0-9]{3}\s*[a-zA-ZÀ-ú]+$')*/
);
CREATE TABLE orders(
order_no INTEGER PRIMARY KEY,
cust_no INTEGER NOT NULL REFERENCES customer,
date DATE NOT NULL
/*order_no must exist in contains*/
);
CREATE TABLE pay(
order_no INTEGER PRIMARY KEY REFERENCES orders,
cust_no INTEGER NOT NULL REFERENCES customer
);
CREATE TABLE employee(
ssn VARCHAR(20) PRIMARY KEY,
TIN VARCHAR(20) UNIQUE NOT NULL,
bdate DATE,
name VARCHAR NOT NULL,
CHECK (AGE(CURRENT_DATE, bdate) >= INTERVAL '18 years')
--age must be >=18
);
CREATE TABLE process(
ssn VARCHAR(20) REFERENCES employee,
order_no INTEGER REFERENCES orders,
PRIMARY KEY (ssn, order_no)
);
CREATE TABLE department(
name VARCHAR PRIMARY KEY
);
CREATE TABLE workplace(
address VARCHAR PRIMARY KEY,
lat NUMERIC(8, 6) NOT NULL,
long NUMERIC(9, 6) NOT NULL,
UNIQUE(lat, long)
    
--address must be in warehouse or office but not both
);

CREATE OR REPLACE FUNCTION check_workplace_address(address VARCHAR)
  RETURNS BOOLEAN AS
$$
BEGIN
  IF EXISTS (
    SELECT 1 FROM office WHERE address = check_workplace_address.address
  ) THEN
    IF EXISTS (
      SELECT 1 FROM warehouse WHERE address = check_workplace_address.address
    ) THEN
      RETURN FALSE;
    END IF;
  END IF;

  RETURN TRUE;
END;
$$
LANGUAGE plpgsql;

CREATE TABLE office(
address VARCHAR(255) PRIMARY KEY REFERENCES workplace
);
CREATE TABLE warehouse(
address VARCHAR(255) PRIMARY KEY REFERENCES workplace
);
CREATE TABLE works(
ssn VARCHAR(20) REFERENCES employee,
name VARCHAR(200) REFERENCES department,
address VARCHAR(255) REFERENCES workplace,
PRIMARY KEY (ssn, name, address)
);
CREATE TABLE product(
SKU VARCHAR(25) PRIMARY KEY,
name VARCHAR(200) NOT NULL,
description VARCHAR,
price NUMERIC(10, 2) NOT NULL,
ean NUMERIC(13) UNIQUE
);
CREATE TABLE contains(
order_no INTEGER REFERENCES orders,
SKU VARCHAR(25) REFERENCES product,
qty INTEGER,
PRIMARY KEY (order_no, SKU)
);
CREATE TABLE supplier(
TIN VARCHAR(20) PRIMARY KEY,
name VARCHAR(200),
address VARCHAR(255),
SKU VARCHAR(25) REFERENCES product,
date DATE
);
CREATE TABLE delivery(
address VARCHAR(255) REFERENCES warehouse,
TIN VARCHAR(20) REFERENCES supplier,
PRIMARY KEY (address, TIN)
);

*  postgresql://db:***@postgres/db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [40]:
%%sql
/* inserting into the costumers table*/
INSERT INTO customer (cust_no, name, email, phone, address)
VALUES
(1, 'Zeus', 'zeus@example.com', '1234567890', '121 Mount Olympus,1234-456 Greece'),
(2, 'Hera', 'hera@example.com', '9876543210', '010 Olympus Street,5432-123 Greece');

*  postgresql://db:***@postgres/db
2 rows affected.

[]

In [41]:
%%sql
/*inserting into the orders table*/
INSERT INTO orders (order_no, cust_no, date)
VALUES
(1, 1, '2023-06-01'),
(2, 2, '2023-06-05');

*  postgresql://db:***@postgres/db
2 rows affected.

[]

In [42]:
%%sql
/*pay table*/
INSERT INTO pay (order_no, cust_no)
VALUES
(1, 1),
(2, 2);

*  postgresql://db:***@postgres/db
2 rows affected.

[]

In [43]:
%%sql
/*emplpyee table*/
INSERT INTO employee (ssn, TIN, bdate, name)
VALUES
('111111111', '111111111', '1990-01-01', 'Apollo'),
('222222222', '222222222', '1995-02-02', 'Artemis');

*  postgresql://db:***@postgres/db
2 rows affected.

[]

In [44]:
%%sql
/*check the age check*/
INSERT INTO employee (ssn, TIN, bdate, name)
VALUES
('123', '123', '2020-01-01', 'someone');

*  postgresql://db:***@postgres/db
(psycopg2.errors.CheckViolation) new row for relation "employee" violates check constraint "employee_bdate_check"
DETAIL:  Failing row contains (123, 123, 2020-01-01, someone).

[SQL: /*check the age check*/
INSERT INTO employee (ssn, TIN, bdate, name)
VALUES
('123', '123', '2020-01-01', 'someone');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [45]:
%%sql
/*process table*/
INSERT INTO process (ssn, order_no)
VALUES
('111111111', 1),
('222222222', 2);

*  postgresql://db:***@postgres/db
2 rows affected.

[]

In [46]:
%%sql
/*departemnet*/
INSERT INTO department (name)
VALUES
('Development'),
('Sales');

*  postgresql://db:***@postgres/db
2 rows affected.

[]

In [48]:
%%sql
/*workplace*/
INSERT INTO workplace (address, lat, long)
VALUES
('123 Main Street', 37.983809, 23.727538),
('456 Elm Street', 38.011663, 23.732757);

*  postgresql://db:***@postgres/db
2 rows affected.

[]

In [49]:
%%sql
/*office*/
INSERT INTO office (address)
VALUES
('123 Main Street');

*  postgresql://db:***@postgres/db
1 rows affected.

[]

In [50]:
%%sql
INSERT INTO warehouse (address)
VALUES
('456 Elm Street');

*  postgresql://db:***@postgres/db
1 rows affected.

[]

In [51]:
%%sql
/*works*/
INSERT INTO works (ssn, name, address)
VALUES
('111111111', 'Development', '123 Main Street'),
('222222222', 'Sales', '456 Elm Street');

*  postgresql://db:***@postgres/db
2 rows affected.

[]

In [52]:
%%sql
/*product*/
INSERT INTO product (SKU, name, description, price, ean)
VALUES
('P1', 'Thunderbolt', 'Powerful weapon', 99.99, 1234567890123),
('P2', 'Moonbow', 'Ethereal bow', 149.99, 9876543210987);

*  postgresql://db:***@postgres/db
2 rows affected.

[]

In [53]:
%%sql
/*contains*/
INSERT INTO contains (order_no, SKU, qty)
VALUES
(1, 'P1', 2),
(2, 'P2', 1);

*  postgresql://db:***@postgres/db
2 rows affected.

[]

In [54]:
%%sql
/*suplier*/
INSERT INTO supplier (TIN, name, address, SKU, date)
VALUES
('S1', 'Athena Supplies', 'Mount Olympus, 12345 Greece', 'P1', '2023-06-02'),
('S2', 'Hermes Delivery', 'Olympus Street, 54321 Greece', 'P2', '2023-06-06');

*  postgresql://db:***@postgres/db
2 rows affected.

[]

In [55]:
%%sql
/*delivery*/
INSERT INTO delivery (address, TIN)
VALUES
('456 Elm Street', 'S2');

*  postgresql://db:***@postgres/db
1 rows affected.

[]